-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2022 年 12 月 26 日 01:14
-- 伺服器版本： 10.4.21-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `circular_journeys`
--

-- --------------------------------------------------------

--
-- 資料表結構 `admins`
--

CREATE TABLE `admins` (
  `sid` int(11) NOT NULL,
  `account_id` varchar(255) NOT NULL,
  `password_hash` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `admins`
--

INSERT INTO `admins` (`sid`, `account_id`, `password_hash`) VALUES
(2, 'kevinLa', '$2y$10$uS4kY1gRTYj02v12uvr/SeL1HYqnLEoTdzJpM/u7V8LW4nKlthkSq'),
(3, 'Anchor', '$2y$10$8ygdQqqGJ7mQSzE7FEoXk./N0G6XGJbYJcjPzTsxOYXQV1t3OWmsC'),
(4, 'Circle', '$2y$10$lxNFSJhX8YZnuSzwm8pEIOjlH166vq0b8XqUsQFTpVxY.VHyif2mq'),
(5, 'Alan', '$2y$10$m7ScZmsTplvDxbxRkYxdmunfJHbZ7F04PAUBWOBL9djX5BH.6/M0.'),
(6, 'Feng', '$2y$10$Hhx.wOdaLu.ncG9DSRPEGOU.lXv5t68bgRtEq5TFFc0q5CYqI.n82');

-- --------------------------------------------------------

--
-- 資料表結構 `events_menu`
--

CREATE TABLE `events_menu` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `image` text DEFAULT NULL,
  `description` text DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `modified_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `events_menu`
--

INSERT INTO `events_menu` (`id`, `name`, `image`, `description`, `created_at`, `modified_at`) VALUES
(100000002, '測試測試測試測試', '測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試', '測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試', '2022-12-22 11:07:18', NULL),
(100000003, '測試測試測試測試', '測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試', '123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123', '2022-12-22 11:07:18', NULL),
(100000004, '測試測試測試測試', '123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123', '123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123', '2022-12-22 11:07:18', NULL),
(100000005, '測試測試測試測試', '123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123', '123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123', '2022-12-22 11:07:18', NULL),
(100000006, '測試測試測試測試', '123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123', '123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123123122312312312312312312123', '2022-12-22 11:07:18', NULL),
(100000007, '測試測試測試測試', '測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試', '測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試測試', '2022-12-22 15:22:01', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `history_likes`
--

CREATE TABLE `history_likes` (
  `id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `member_id` varchar(20) NOT NULL,
  `created_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `orders`
--

INSERT INTO `orders` (`id`, `order_id`, `member_id`, `created_at`) VALUES
(3, 485520285, '3644812', '2022-12-24'),
(4, 485525285, '3644813', '2022-12-24'),
(5, 923102435, '3744812', '2022-12-24'),
(6, 923402435, '3844812', '2022-12-24');

-- --------------------------------------------------------

--
-- 資料表結構 `order_confirmation`
--

CREATE TABLE `order_confirmation` (
  `id` int(11) NOT NULL,
  `payment_id` int(11) NOT NULL,
  `total` decimal(20,0) NOT NULL,
  `created_at` date NOT NULL,
  `modified_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `order_confirmation`
--

INSERT INTO `order_confirmation` (`id`, `payment_id`, `total`, `created_at`, `modified_at`) VALUES
(1, 3, '3', '2022-12-10', '2022-12-30');

-- --------------------------------------------------------

--
-- 資料表結構 `post`
--

CREATE TABLE `post` (
  `post_id` int(11) NOT NULL,
  `created_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `modified_date` timestamp NULL DEFAULT current_timestamp(),
  `member_id` int(11) DEFAULT NULL,
  `post_title` varchar(50) NOT NULL,
  `post_content` varchar(2000) NOT NULL,
  `is_reported` tinyint(1) NOT NULL DEFAULT 0,
  `post_likes` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `post`
--

INSERT INTO `post` (`post_id`, `created_date`, `modified_date`, `member_id`, `post_title`, `post_content`, `is_reported`, `post_likes`) VALUES
(1, '2022-12-22 08:34:30', NULL, 12345, '高雄之旅：遊覽城市景點、品嘗美食和體驗文化', '高雄是台灣南部的一座繁華都市，有許多美麗的景點和美食可供遊客品嘗。在這裡，你可以沿著高雄市中心的愛河散步，感受城市的活力；也可以前往高雄市區周邊的山區遊玩，享受大自然的美景。\r\n一天的行程可以從早上在高雄車站附近的早餐店享用豐富的早餐開始。接著，你可以前往高雄市立美術館，欣賞當地藝術家的作品，或者到高雄塔遊覽，俯瞰整個城市風光。\r\n中午，你可以前往高雄市中心的左營夜市品嘗當地的美食，比如高雄小吃的經典——高雄燒肉。晚上，你可以前往愛河沿岸的風景區，欣賞夜景，或者到高雄的夜市小吃區品嘗當地的小吃。\r\n如果你想要體驗更多的自然景觀，你可以前往高雄市區周邊的山區，例如旗津半島、阿公店溪谷、鳳山山區等。在這裡，你可以漫步在綠意盎然的山谷中，或者登上山頂，俯瞰周圍的美景。\r\n總的來說，高雄是一座美麗的城市，有許多的景點和美食可供遊客品嘗。除了上述提到的景點之外，高雄還有許多其他值得一遊的地方。例如，你可以前往高雄85大樓，俯瞰整座城市的美景；也可以到高雄市立海洋博物館，了解台灣海洋的魅力；或者到高雄市立圖書館，欣賞當地文化藝術展覽。\r\n如果你想要體驗當地的文化，你可以到高雄的蓮池潭區遊覽，這裡有許多古蹟和寺廟，還有著名的蓮潭公園。此外，高雄市還有許多漂亮的海灘可供遊客游泳和曬太陽，例如旗津海水浴場、柯打海水浴場等。\r\n總的來說，高雄是一座美麗的城市，有豐富的歷史文化和自然風光。在這裡，你可以沿著愛河散步，感受城市的活力；也可以前往周邊的山區，享受大自然的美景。無論你是想要欣賞藝術、品嘗美食、了解當地文化，還是想要游泳海灘，高雄都能滿足你的需求。', 0, 0),
(2, '2022-12-22 08:34:30', '2022-12-07 16:00:00', 12347, '高雄藝術之旅', '今天我們去了大東藝術中心，那裡有許多精彩的展覽和活動。我們先參觀了當代藝術展，展出了許多創意十足的作品。接著我們參加了為期一個小時的雕塑工作坊，學習如何製作雕塑。。整個旅程令人耳目一新，我們都很享受。\r\n接下來我們到高雄市立美術館，他是一座不容錯過的文化景點。該館自1985年開幕以來，一直致力於收藏、展示、教育和保育台灣的藝術文化遺產。館內展出的藝術作品涵蓋了台灣近百年的歷史，包括傳統工藝、繪畫、雕塑、攝影等各類媒材。除了定期展覽，高雄市立美術館也舉辦各種文化活動，如講座、工作坊、音樂會、戶外雕塑展等，讓民眾有機會更深入地接觸藝術。\r\n最後，我們在外面的咖啡廳休息了一會兒，欣賞著美麗的城市風景。', 0, 0),
(3, '2022-12-22 08:34:30', '2022-12-19 16:00:00', 12350, '壽山賞猴子', '今天我和朋友登上壽山，海拔約三百多公尺，是一座非常美麗的山。\r\n\r\n我們從下午出發了，一路上看到許多不同的植物和鳥類。爬山的道路有很多可愛的猴子，達到山頂時，美麗的風景讓我們把疲憊忘得一乾二淨，美景令我們流連忘返。\r\n\r\n回程的路程比較輕鬆，我們在山腳下的小店休息了一下，享用著美味的在地小吃。\r\n\r\n整個爬山之旅讓我們收穫頗多，也讓我們更加親近大自然。我們期待下一次登山的挑戰！', 0, 0),
(5, '2022-12-22 08:34:30', NULL, 12345, '檢舉文章001', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(6, '2022-12-22 08:34:30', '2022-10-10 16:00:00', 12346, '高雄一日遊-駁二、愛河、瑞豐夜市', '今天我們先去高雄的駁二藝術特區裡有許多精彩的藝術展覽，我們看了很久才走出來，我們沿著小路漫步，欣賞著各式各樣的藝術作品。接著，我們走到了愛河畔，沿著小徑悠閒地散步，看著河水悠悠地流過。\r\n最後，我們到了瑞豐夜市，吃了許多美味的小吃。首先，我們品嘗了一道傳統的台灣小吃——臭豆腐。臭豆腐的味道香醇，口感酥脆，而且很有嚼勁。接著，我們點了一道高雄特色的海鮮炒麵，裡面有豐富的海鮮，搭配著Q彈的麵條，吃起來非常美味。最後，我們點了一杯珍珠奶茶，清新的口感搭配著珍珠的Q彈，讓我們在逛夜市的同時又能消暑。整個晚上，我們品嘗了許多美味的小吃，並且在瑞豐夜市的氣氛中度過了一個愉快的夜晚。', 0, 0),
(7, '2022-12-22 08:34:30', NULL, 12345, '檢舉文章002', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(8, '2022-12-22 08:34:30', NULL, 12348, '檢舉文章003', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(9, '2022-12-22 08:34:30', NULL, 12350, '檢舉文章004', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(10, '2022-12-22 08:34:30', NULL, 12345, '檢舉文章005', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(11, '2022-12-22 08:34:30', NULL, 12345, '檢舉文章006', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(12, '2022-12-22 08:34:30', NULL, 12350, '檢舉文章007', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(13, '2022-12-22 08:34:30', NULL, NULL, '檢舉文章009', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(14, '2022-12-22 08:34:30', NULL, NULL, '檢舉文章010', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(15, '2022-12-22 08:34:30', NULL, NULL, '檢舉文章011', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(16, '2022-12-22 08:34:30', NULL, NULL, '檢舉文章012', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(17, '2022-12-22 08:34:30', NULL, NULL, '檢舉文章013', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(18, '2022-12-22 08:34:30', NULL, NULL, '檢舉文章014', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(19, '2022-12-22 08:34:30', NULL, 12346, '檢舉文章015', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(20, '2022-12-22 08:34:30', NULL, NULL, '檢舉文章016', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(21, '2022-12-22 08:34:30', NULL, NULL, '檢舉文章017', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(22, '2022-12-22 08:34:30', NULL, 12348, '檢舉文章018', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(23, '2022-12-22 08:34:30', NULL, 12346, '檢舉文章019', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(24, '2022-12-22 08:34:30', NULL, 12347, '檢舉文章020', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(25, '2022-12-22 08:34:30', NULL, 12350, '檢舉文章021', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(26, '2022-12-22 08:34:30', NULL, 12349, '檢舉文章022', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(27, '2022-12-22 08:34:30', NULL, 12348, '檢舉文章023', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(28, '2022-12-22 08:34:30', NULL, 12350, '檢舉文章024', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(29, '2022-12-22 08:34:30', NULL, 12348, '檢舉文章025', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(30, '2022-12-22 08:34:30', NULL, 12347, '檢舉文章026', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(31, '2022-12-22 08:34:30', NULL, 12346, '檢舉文章027', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(32, '2022-12-22 08:34:30', NULL, 12349, '檢舉文章028', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(33, '2022-12-22 08:34:30', NULL, 12349, '檢舉文章029', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(34, '2022-12-22 08:34:30', NULL, 12347, '檢舉文章030', '檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！檢舉警告！', 1, 0),
(38, '2022-12-22 14:25:04', '2022-12-22 14:25:04', NULL, 'title', 'content', 0, 0),
(50, '2022-12-24 02:27:08', '2022-12-24 02:27:08', NULL, '文章標題', '文章內文', 0, 0),
(52, '2022-12-24 03:43:00', '2022-12-24 03:43:00', NULL, '壽山賞猴子2', '今天我和朋友登上壽山，海拔約三百多公尺，是一座非常美麗的山。\r\n\r\n我們從下午出發了，一路上看到許多不同的植物和鳥類。爬山的道路有很多可愛的猴子，達到山頂時，美麗的風景讓我們把疲憊忘得一乾二淨，美景令我們流連忘返。\r\n\r\n回程的路程比較輕鬆，我們在山腳下的小店休息了一下，享用著美味的在地小吃。\r\n\r\n整個爬山之旅讓我們收穫頗多，也讓我們更加親近大自然。我們期待下一次登山的挑戰喔！', 0, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `description` varchar(500) NOT NULL,
  `image` varchar(500) NOT NULL,
  `price` decimal(36,0) NOT NULL,
  `created_at` date NOT NULL,
  `modified_at` date NOT NULL,
  `category_id` varchar(25) NOT NULL,
  `inventory_id` int(11) NOT NULL,
  `active_status` varchar(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`id`, `name`, `description`, `image`, `price`, `created_at`, `modified_at`, `category_id`, `inventory_id`, `active_status`) VALUES
(79, 'CJ\'s 萬用手提包 (深藍)', 'CJ\'s 萬用手提包是一個耐用、多功能的選擇，適用於各種旅行目的地。超大容量，可以輕鬆容納你所有的旅行用品。此外，它還配有可拆卸肩帶，方便你在旅行中彈性調整。\r\n\r\n設計精美，這款旅行包既時尚又功能強大。它的外層采用了防水材質，能有效保護你的物品不受潮濕影響。此外，它還配有許多口袋和插扣，方便你組織和分類旅行用品。\r\n\r\n不管是在城市中漫步，還是在野外旅行，這款旅行包都能為你提供最佳的保護和便利。它是你旅行的理想夥伴，讓你的旅行更加愉快和輕鬆。', 'product-images/image_63a6f9a713b9c.jpg', '1900', '2022-12-24', '2022-12-24', '旅行包包 / 行李 / 收納', 25, '1'),
(80, 'CJ\'s 萬用手提包 (咖啡)', 'CJ\'s 萬用手提包是一個耐用、多功能的選擇，適用於各種旅行目的地。超大容量，可以輕鬆容納你所有的旅行用品。此外，它還配有可拆卸肩帶，方便你在旅行中彈性調整。 設計精美，這款旅行包既時尚又功能強大。它的外層采用了防水材質，能有效保護你的物品不受潮濕影響。此外，它還配有許多口袋和插扣，方便你組織和分類旅行用品。 不管是在城市中漫步，還是在野外旅行，這款旅行包都能為你提供最佳的保護和便利。它是你旅行的理想夥伴，讓你的旅行更加愉快和輕鬆。', 'product-images/image_63a6faa4b0358.jpg', '2000', '2022-12-24', '2022-12-24', '旅行包包 / 行李 / 收納', 18, '1'),
(81, 'CJ\'s 城市包 (藍)', 'CJ\'s 城市包是一個耐用、多功能的選擇，適用於各種旅行目的地。超大容量，可以輕鬆容納你所有的旅行用品。此外，它還配有可拆卸肩帶，方便你在旅行中彈性調整。 設計精美，這款旅行包既時尚又功能強大。它的外層采用了防水材質，能有效保護你的物品不受潮濕影響。此外，它還配有許多口袋和插扣，方便你組織和分類旅行用品。 不管是在城市中漫步，還是在野外旅行，這款旅行包都能為你提供最佳的保護和便利。它是你旅行的理想夥伴，讓你的旅行更加愉快和輕鬆。', 'product-images/image_63a6faed50df6.jpg', '1700', '2022-12-24', '2022-12-24', '旅行包包 / 行李 / 收納', 6, '0'),
(82, 'CJ\'s 西裝收納包 (深藍)', 'CJ\'s 西裝收納包是一個耐用、多功能的選擇，適用於各種場合。超大空間，可以輕鬆容納你的西裝、衬衫、領帶等衣物。此外，它還配有一個可拆卸插扣，方便你在出差或是旅行中攜帶。\r\n\r\n設計精美，這款收納包既優雅又實用。它的外層采用了防刮、耐磨的材質，能有效保護你的物品不受損壞。此外，它還配有許多口袋和插扣，方便你組織和分類日常用品。\r\n\r\n外觀方面，這款收納包提供了多種顏色和款式選擇。你可以根據自己的喜好選擇最適合你的款式。不管是在商務會議中，還是在旅行中，這款收納包都能為你提供最佳的便利。它是你生活中不可或缺的好幫手，讓你的穿著始終保持整潔和精致。', 'product-images/image_63a6fd34d9f86.jpg', '1500', '2022-12-24', '2022-12-24', '旅行包包 / 行李 / 收納', 6, '0'),
(83, 'CJ\'s 行李保護套', 'CJ\'s 行李保護套是一個耐用、多功能的選擇，適用於各種行李。它的外層采用了防水、防污染的材質，能有效保護你的行李不受潮濕、污染的影響。此外，它還配有一個可拆卸插扣和一個可拆卸肩帶，方便你在旅行中攜帶。\r\n\r\n設計精美，這款保護套既優雅又實用。它的多層設計能有效保護你的行李不受撞擊、擠壓的影響。此外，它還配有許多口袋和插扣，方便你組織和分類旅行用品。\r\n\r\n外觀方面，這款保護套提供了多種顏色和款式選擇。你可以根據自己的喜好選擇最適合你的款式。不管是在機場、火車站，還是在旅館中，這款保護套都能為你提供最佳的保護和便利。它是你旅行中不可或缺的好幫手，讓你的行李始終保持整潔和完好。\r\n\r\n此外，這款保護套還提供了自適應的尺寸設計，能輕鬆地套在各種大小的行李上。它是一款高性價比的產品，讓你的旅行更加愉快和輕鬆。', 'product-images/image_63a6fe91e7655.jpeg', '700', '2022-12-24', '2022-12-24', '旅行包包 / 行李 / 收納', 17, '0'),
(84, 'CJ\'s 旅遊防盜包包', 'CJ\'s 旅遊防盜包包是一個安全、耐用的選擇，適用於各種旅行目的地。它的外層采用了防盜鎖、防盜拉鍊等防盜措施，能有效保護你的財物不受盜竊的威脅。此外，它還配有一個反光標識和一個隱形插扣，方便你在旅行中攜帶。\r\n\r\n設計精美，這款包包既優雅又實用。它的多層設計能有效保護你的財物不受撞擊、擠壓的影響。此外，它還配有許多口袋和插扣，方便你組織和分類旅行用品。\r\n\r\n外觀方面，這款包包提供了多種顏色和款式選擇。你可以根據自己的喜好選擇最適合你的款式。不管是在城市裡漫步，還是在野外旅行，這款包包都能為你提供最佳的保護和便利。它是你旅行中不可或缺的好幫手，讓你的財物始終保持安全和完好。\r\n\r\n此外，這款包包還提供了自適應的尺寸設計，能輕鬆地套在各種大小的行李上。它是一款高性價比的產品，讓你的旅行更加愉快和輕鬆。', 'product-images/image_63a7018bc0d42.jpg', '2500', '2022-12-24', '2022-12-24', '旅行包包 / 行李 / 收納', 16, '0');

-- --------------------------------------------------------

--
-- 資料表結構 `product_categories`
--

CREATE TABLE `product_categories` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `description` varchar(200) NOT NULL,
  `created_at` date NOT NULL,
  `deleted_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `product_inventories`
--

CREATE TABLE `product_inventories` (
  `id` int(11) NOT NULL,
  `quantity` int(11) NOT NULL,
  `created_at` date NOT NULL,
  `deleted_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `product_tags`
--

CREATE TABLE `product_tags` (
  `id` int(11) NOT NULL,
  `product_tag_id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `product_tags_category`
--

CREATE TABLE `product_tags_category` (
  `product_tag_id` int(11) NOT NULL,
  `product` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `product_tags_category`
--

INSERT INTO `product_tags_category` (`product_tag_id`, `product`) VALUES
(1, '登山'),
(2, '戶外');

-- --------------------------------------------------------

--
-- 資料表結構 `shopping_carts`
--

CREATE TABLE `shopping_carts` (
  `id` int(11) NOT NULL,
  `member_id` varchar(20) NOT NULL,
  `product_id` int(11) NOT NULL,
  `quantity` int(4) NOT NULL,
  `created_at` date NOT NULL,
  `modfied_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `shopping_carts`
--

INSERT INTO `shopping_carts` (`id`, `member_id`, `product_id`, `quantity`, `created_at`, `modfied_at`) VALUES
(1, '2', 2, 2, '2022-12-23', '2022-12-31');

-- --------------------------------------------------------

--
-- 資料表結構 `tourist_tags`
--

CREATE TABLE `tourist_tags` (
  `id` int(11) NOT NULL,
  `tourist_tag_id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `tourist_tags_category`
--

CREATE TABLE `tourist_tags_category` (
  `tourist_tag_id` int(11) NOT NULL,
  `tourist_spot` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `tourist_tags_category`
--

INSERT INTO `tourist_tags_category` (`tourist_tag_id`, `tourist_spot`) VALUES
(1, '駁二'),
(2, '壽山'),
(3, '澄清湖'),
(4, '愛河'),
(5, '美術館'),
(6, '英國領事館'),
(7, '中都溼地'),
(8, '衛武營'),
(9, '香蕉碼頭'),
(10, '小崗山'),
(11, '旗津'),
(12, '西子灣'),
(13, '巨蛋'),
(14, '凹子底'),
(15, '中央公園'),
(16, '新崛江'),
(17, '岡山老街'),
(18, '高雄港'),
(19, '大東'),
(20, '瑞豐夜市'),
(21, '流行音樂中心'),
(22, '蓮池潭'),
(24, '淨園農場'),
(25, '忠烈祠'),
(26, '動物園'),
(27, '龍湖塔'),
(28, '義大'),
(29, '佛光山'),
(30, '文化中心'),
(31, '糖廠'),
(32, '旗山'),
(33, '英國領事館'),
(34, '岡山之眼'),
(35, '半屏山'),
(36, '泥火山'),
(37, '阿公店水庫'),
(38, '興達港'),
(39, '觀音山'),
(40, '月世界');

-- --------------------------------------------------------

--
-- 資料表結構 `users_information`
--

CREATE TABLE `users_information` (
  `id` int(11) NOT NULL COMMENT '編號',
  `member_id` varchar(25) NOT NULL COMMENT '會員編號',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() COMMENT '註冊日期',
  `active_status` tinyint(1) NOT NULL COMMENT '狀態',
  `first_name` varchar(25) NOT NULL COMMENT '姓',
  `last_name` varchar(25) NOT NULL COMMENT '名',
  `birthday` date NOT NULL COMMENT '生日',
  `sex` char(1) NOT NULL COMMENT '性別',
  `password` varchar(50) NOT NULL COMMENT '密碼',
  `token` varchar(50) NOT NULL COMMENT '驗證碼',
  `email` varchar(25) NOT NULL COMMENT '信箱',
  `telephone` varchar(25) NOT NULL COMMENT '電話',
  `country` varchar(25) NOT NULL COMMENT '國家',
  `city` varchar(30) NOT NULL COMMENT '城市',
  `postal_code` varchar(10) NOT NULL COMMENT '郵遞區號',
  `address` varchar(50) NOT NULL COMMENT '地址',
  `payment_type` varchar(25) NOT NULL COMMENT '付款種類',
  `provider` varchar(25) NOT NULL COMMENT '供應商',
  `account_no` varchar(25) NOT NULL COMMENT '卡號',
  `expiry` date NOT NULL COMMENT '到期日'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='user_databases';

--
-- 傾印資料表的資料 `users_information`
--

INSERT INTO `users_information` (`id`, `member_id`, `created_at`, `active_status`, `first_name`, `last_name`, `birthday`, `sex`, `password`, `token`, `email`, `telephone`, `country`, `city`, `postal_code`, `address`, `payment_type`, `provider`, `account_no`, `expiry`) VALUES
(1, '12345', '2022-12-21 02:44:42', 1, 'Chou', 'Alan', '0000-00-00', 'm', '123456', 'f1b699cc9af3eeb98e5de244ca7802ae38e77bae', 'alan@gmail.com', '0900000000', '台灣', '高雄市', '80711', '高雄市阿公店水庫', '信用卡', 'VISA', '1111 2222 3333 4444', '2022-12-21'),
(2, '12346', '2022-12-21 02:56:42', 1, 'La', 'Kevin', '0000-00-00', 'f', '123456', 'f1b699cc9af3eeb98e5de244ca7802ae38e77bae', 'kevin@gmail.com', '0900000000', '台灣', '高雄市', '80711', '高雄市阿公店0號水庫', '信用卡', 'VISA', '1111 2222 3333 4444', '2022-12-21'),
(3, '12347', '2022-12-21 02:57:28', 1, '陳', '家禾', '0000-00-00', 'f', '123456', 'f1b699cc9af3eeb98e5de244ca7802ae38e77bae', 'kevin@gmail.com', '0900000000', '台灣', '高雄市', '80711', '高雄市阿公店1號水庫', '信用卡', 'VISA', '1111 2222 3333 4444', '2022-12-21'),
(4, '12348', '2022-12-21 02:58:19', 1, '張', '圓圓', '1996-06-05', 'f', '123456', 'f1b699cc9af3eeb98e5de244ca7802ae38e77bae', 'circle@gmail.com', '0900000000', '台灣', '高雄市', '80711', '高雄市阿公店1號水庫', '信用卡', 'VISA', '1111 2222 3333 4444', '2022-12-21'),
(7, 'PFDGF7JOVB', '2022-12-23 07:22:54', 1, '陳', '小雪', '1955-01-15', 'f', '42c17f8d84f7aee34c58d8c68b9ce2a13fc22ac6', '42c17f8d84f7aee34c58d8c68b9ce2a13fc22ac6', 'ggmod@gmail.com', '0911888888', '臺灣', '新竹縣', '112321', '公園裡', '信用卡', 'MasterCard', '7890 1278 5712 8037', '2026-03-26'),
(8, '95L1A3SYV5', '2022-12-23 08:27:07', 1, '陳', '阿美', '1999-11-16', 'f', 'bccdcf4ff371bb560d8792147b51f73400dc3da3', 'bccdcf4ff371bb560d8792147b51f73400dc3da3', 'yyy123@gmail.com', '0913123123', '臺灣', '新北市', '131231', '耶誕城廁所內', '信用卡', 'JCB', '3412 3412 4214 2141', '2026-09-09'),
(9, 'WY9TK8JKKL', '2022-12-23 09:18:19', 1, '王', '八蛋', '2022-12-21', 'm', '7110eda4d09e062aa5e4a390b0a572ac0d2c0220', '7110eda4d09e062aa5e4a390b0a572ac0d2c0220', '8873743@yaoo.com', '033942882', '臺灣', '高雄市', '211', 'hjdfkhakdjfhsjkdf', '信用卡', 'VISA', '4444 5555 7777 2222', '2022-12-04');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `account_id_2` (`account_id`),
  ADD KEY `account_id` (`account_id`);

--
-- 資料表索引 `events_menu`
--
ALTER TABLE `events_menu`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `history_likes`
--
ALTER TABLE `history_likes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`,`member_id`);

--
-- 資料表索引 `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `member_id` (`member_id`);

--
-- 資料表索引 `order_confirmation`
--
ALTER TABLE `order_confirmation`
  ADD PRIMARY KEY (`id`),
  ADD KEY `payment_id` (`payment_id`);

--
-- 資料表索引 `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`post_id`),
  ADD KEY `member_id` (`member_id`);

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `category_id` (`category_id`),
  ADD KEY `inventory_id` (`inventory_id`);

--
-- 資料表索引 `product_categories`
--
ALTER TABLE `product_categories`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `product_inventories`
--
ALTER TABLE `product_inventories`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `product_tags`
--
ALTER TABLE `product_tags`
  ADD PRIMARY KEY (`id`),
  ADD KEY `tourist_tag_id` (`product_tag_id`,`post_id`),
  ADD KEY `post_id` (`post_id`);

--
-- 資料表索引 `product_tags_category`
--
ALTER TABLE `product_tags_category`
  ADD PRIMARY KEY (`product_tag_id`);

--
-- 資料表索引 `shopping_carts`
--
ALTER TABLE `shopping_carts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `member_id` (`member_id`),
  ADD KEY `product_id` (`product_id`);

--
-- 資料表索引 `tourist_tags`
--
ALTER TABLE `tourist_tags`
  ADD PRIMARY KEY (`id`),
  ADD KEY `tourist_tag_id` (`tourist_tag_id`,`post_id`),
  ADD KEY `post_id` (`post_id`);

--
-- 資料表索引 `tourist_tags_category`
--
ALTER TABLE `tourist_tags_category`
  ADD PRIMARY KEY (`tourist_tag_id`) USING BTREE;

--
-- 資料表索引 `users_information`
--
ALTER TABLE `users_information`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id` (`member_id`),
  ADD UNIQUE KEY `member_id` (`member_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `admins`
--
ALTER TABLE `admins`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `events_menu`
--
ALTER TABLE `events_menu`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=100000008;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `history_likes`
--
ALTER TABLE `history_likes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order_confirmation`
--
ALTER TABLE `order_confirmation`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `post`
--
ALTER TABLE `post`
  MODIFY `post_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=85;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_categories`
--
ALTER TABLE `product_categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_inventories`
--
ALTER TABLE `product_inventories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_tags`
--
ALTER TABLE `product_tags`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_tags_category`
--
ALTER TABLE `product_tags_category`
  MODIFY `product_tag_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `shopping_carts`
--
ALTER TABLE `shopping_carts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `tourist_tags`
--
ALTER TABLE `tourist_tags`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `tourist_tags_category`
--
ALTER TABLE `tourist_tags_category`
  MODIFY `tourist_tag_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `users_information`
--
ALTER TABLE `users_information`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '編號', AUTO_INCREMENT=10;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
